Autodesk.Revit.DB.CompoundStructure.CreateSimpleCompoundStructure(System.Collections.Generic.IList`1{Autodesk.Revit.DB.CompoundStructureLayer})
Creates a non-vertically compound structure comprised of parallel layers.
Remarks:
All layers are in the core, i.e. there are no shell layers created.
layers:
An array which describes the parallel layers of this compound structure.
Returns:
A newly created compound structure.
Throws Autodesk.Revit.Exceptions.ArgumentException:
One or more layers is not valid.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL

Autodesk.Revit.DB.CompoundStructure.SetExtendableRegionIds(System.Boolean,System.Collections.Generic.IList`1{System.Int32})
Sets the extendable region ids for the compound structure.
Remarks:
Regions along the top or bottom of the wall may be set to be extendable.
top:
If true, set ids of regions which are extendable at the top, otherwise
set the ids of regions which are extendable at the bottom.
regionIds:
The ids of regions which will be extendable.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The region ids are not valid.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This operation is valid only for vertically compound structures.

Autodesk.Revit.DB.CompoundStructure.SetLayers(System.Collections.Generic.IList`1{Autodesk.Revit.DB.CompoundStructureLayer})
Sets the characteristics of the layers for this CompoundStructure.
Remarks:
This function will replace all existing layers with the contents of the input.  This provides a full
reset for the CompoundStructure. Therefore:
All layers will be marked as Core layers, and any settings related to Shell layers (such as Autodesk.Revit.DB.CompoundStructure.GetFirstCoreLayerIndex,
Autodesk.Revit.DB.CompoundStructure.GetLastCoreLayerIndex or Autodesk.Revit.DB.CompoundStructure.GetCoreBoundaryLayerIndex(Autodesk.Revit.DB.ShellLayerType)) will be modified accordingly.Because all layers will be set as Core layers, the value of LayerCapFlag will be ignored (and set to true) automatically.The Autodesk.Revit.DB.CompoundStructure.VariableLayerIndex will be unset.The Autodesk.Revit.DB.CompoundStructure.StructuralMaterialIndex will be unset.The compound structure will be set to be vertically homogeneous.
layers:
The layers to be set.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL

Autodesk.Revit.DB.CompoundStructure.IsValid(Autodesk.Revit.DB.Document,System.Collections.Generic.IDictionary`2{System.Int32,Autodesk.Revit.DB.CompoundStructureError}@,System.Collections.Generic.IDictionary`2{System.Int32,System.Int32}@)
Checks for errors or inconsistencies in the data in this CompoundStructure.
Remarks:
This check is run before the CompoundStructure may be assigned to a particular ElementType.
doc:
Access to the document in which the CompoundStructure will be used.
errMap:
This map will associate each problematic layer index to a value in CompoundStructureError.
General structure errors are reported as associated to layer index -1.
twoLayerErrorsMap:
The map is associated to a check run only for vertically Compound Structures.
Essentially the Compound Structure is sliced at representative heights.
It looks at the region from exterior to interior, and requires that the assigned layer indices do not decrease.
If they do, an entry is generated for this map. The first entry is the last valid layer index encountered.
The second entry is a region id whose assigned layer index is too small: it should be at least as large as the first entry.
Returns:
True if the compound structure is valid for the document, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL

Autodesk.Revit.DB.CompoundStructure
Describes the internal structure of a wall, floor, roof or ceiling.
Remarks:
A compound structure consists a collection of ordered layers, proceeding from exterior to interior for a wall, or from top to bottom for a
floor, roof or ceiling. The properties of these layers determine the
thickness, material, and function of the overall structure of the associated wall, floor, roof or ceiling.  Layers can
be accessed via the Autodesk.Revit.DB.CompoundStructure.GetLayers method and completely replaced using SetLayers().  Layers
can also be accessed and modified individually using the "layer index", which is a value from in the range [0, LayerCount)
identifying the layer in the structure.
A structure supports the concept of "core layers" and "shell layers".  There are two layer indices which identify
where the boundary between core and shell layers occur in the list of layers.  The boundaries between shell and core layers
are identifiable using
Autodesk.Revit.DB.CompoundStructure.GetFirstCoreLayerIndex, Autodesk.Revit.DB.CompoundStructure.GetLastCoreLayerIndex, Autodesk.Revit.DB.CompoundStructure.GetCoreBoundaryLayerIndex(Autodesk.Revit.DB.ShellLayerType)
or Autodesk.Revit.DB.CompoundStructure.GetNumberOfShellLayers(Autodesk.Revit.DB.ShellLayerType).  The core layer boundary can be changed with Autodesk.Revit.DB.CompoundStructure.SetNumberOfShellLayers(Autodesk.Revit.DB.ShellLayerType,System.Int32).
Compound structures may be vertically compound.  If Autodesk.Revit.DB.CompoundStructure.IsVerticallyCompound is false,
the CompoundStructure describes a series of parallel layers, each with specified width, function, material and other properties.
If Autodesk.Revit.DB.CompoundStructure.IsVerticallyCompound is true (which should apply only for CompoundStructures assigned to walls) then
horizontal sections at different elevations may have different layered
structures. In this case, the structure describes a vertical section via a rectangle
which is divided into polygonal regions whose sides are all vertical or horizontal segments.
A map associates each of these regions with the index of a layer in the CompoundStructure which
determines the properties of that region.